#+setupfile: ../research.org

#+title: Nodal Lane Detection
#+date: Updated: \today
#+author: Lewis Collum
*Started 03/04/2020*

** Concept Example
   #+begin_src python :results output
class Subject:
    def __init__(self, observers: list):
        self.observers = observers

    def notifyObservers(self, data):
        for observer in self.observers:
            observer.grab(data)

class Observer:
    def grab(self, data):
        print(data)

        
observerA = Observer()
observerB = Observer()
subject = Subject([observerA, observerB])

subject.notifyObservers("pickle")

class Node:
    def __init__(self, strategy, observers: list):
        self.observers = observers
        self.strategy = strategy

    def notifyObservers(self, data):
        for observer in self.observers:
            observer.grab(data)
    
    def grab(self, data):
        self.notifyObservers(self.strategy(data))

nodeB = Node(
    strategy = lambda data: print(data*3),
    observers = [])

nodeA = Node(
    strategy = lambda data: data*2,
    observers = [nodeB])

head = Node(
    strategy = None,
    observers = [nodeA])

head.notifyObservers(data = 1)


def doA(data):
    return data*3

def doB(data):
    return data*2

A = doA(1)
B = doB(A)
print(B)
   #+end_src

   #+RESULTS:
   : pickle
   : pickle
   : 6
   : 6

** Polar Fitting
   #+begin_src python :results output
import numpy

x = (0, 0)
y = (1, 4)
A = numpy.polyfit(y, x, deg=1)
A[1] = -A[1]/A[0]
A[0] = 1/A[0]
print(A)
   #+end_src

   #+RESULTS:
   : [inf nan]
